#include"data.h"
void insert_start()
{
	system("reset");
	printf("\033[;34m \t\t\t\t**********************************欢迎使用智能聊天室***************************\n\033[0m");
    printf("\033[;34m \t\t\t\t*                                                                             *\n\033[0m");
    printf("\033[;34m \t\t\t\t*                                1、注册请输入reg                             *\n\033[0m");
    printf("\033[;34m \t\t\t\t*                                2、登录请输入log                             *\n\033[0m");
    printf("\033[;34m \t\t\t\t*                                3、帮助信息help                              *\n\033[0m");
    printf("\033[;34m \t\t\t\t*                                4、使用ID登陆logid                           *\n\033[0m");
    printf("\033[;34m \t\t\t\t*                                5、放弃登录exit                              *\n\033[0m");
    printf("\033[;34m \t\t\t\t*                                                                             *\n\033[0m");
    printf("\033[;34m \t\t\t\t*          为了维护本智能聊天的数据安全和通信请勿登录超过20个客户端           *\n\033[0m");
    printf("\033[;34m \t\t\t\t*                                                  design by samuel           *\n\033[0m");
    printf("\033[;34m \t\t\t\t*******************************************************************************\n\033[0m");
}
void insert_help(char *name)
{
	system("reset");
	printf("\033[;32m *******************************************************欢迎登录智能聊天室*******************************************************\n\033[0m");
    printf("\033[;32m *    在线用户:     |               当前用户：%s                                                              \n\033[0m",name);
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m *                  |************************************************************************************************************\n\033[0m");
    printf("\033[;32m *                  | 功能说明：                                                                                                *\n\033[0m");
    printf("\033[;32m *                  | 1、chat 私聊服务         |  2、all            群发服务                                                    *\n\033[0m");
    printf("\033[;32m *                  | 3、look 表情服务         |  4、welcome        常用语服务                                                  *\n\033[0m");
    printf("\033[;32m *                  | 5、exit 登录退出         |  6、help           离线服务                                                    *\n\033[0m");
    printf("\033[;32m *                  | 7、passwd 修改密码       |  8、data           察看您的聊天记录                                            *\n\033[0m");
    printf("\033[;32m *                  | 10、send  发送文件       |  11、change        修改用户名                                                  *\n\033[0m");
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m *                  |************************************************************************************************************\n\033[0m");
    printf("\033[;32m *                  |        为了维护本智能聊天的数据安全和通信请勿登录超过20个客户端                                           *\n\033[0m");
    printf("\033[;32m *                  |                                                    由王宁斌设计                                           *\n\033[0m");
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m *                  |************************************************************************************************************\n\033[0m");
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m *                  |   命令行输入：                                                                                            *\n\033[0m");
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m *                  |************************************************************************************************************\n\033[0m");
    printf("\033[;32m *                  |  提示信息：                                  | 发送信息对象：                                             *\n\033[0m");
    printf("\033[;32m *                  |                                              |                                                            *\n\033[0m");
    printf("\033[;32m *                  |                                              | 发送信息内容：                                             *\n\033[0m");
    printf("\033[;32m *                  |                                              |                                                            *\n\033[0m");
    printf("\033[;32m ********************************************************************************************************************************\n\033[0m");
    printf("\033[;32m * 发送方：         | 内容：                                                                                                    *\n\033[0m");
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m *                  |                                                                                                           *\n\033[0m");
    printf("\033[;32m ********************************************************************************************************************************\033[0m");
	printf("\033[21A");
	printf("\n");
	printf("\033[36C");
}
void insert_root(char *name)
{
	system("reset");
	printf("\033[;35m \t\t\t\t*******************************欢迎登录智能聊天室********************************\n\033[0m");
    printf("\033[;35m \t\t\t\t*                                                                               *\n\033[0m");
    printf("\033[;35m \t\t\t\t*         功能说明：                                                            *\n\033[0m");
    printf("\033[;35m \t\t\t\t*           1、chat 私聊服务         |  2、all            群发服务              *\n\033[0m");
    printf("\033[;35m \t\t\t\t*           3、look 表情服务         |  4、welcome        常用语服务            *\n\033[0m");
    printf("\033[;35m \t\t\t\t*           5、exit 登录退出         |  6、help           帮助提醒服务          *\n\033[0m");
    printf("\033[;35m \t\t\t\t*           7、passwd 修改密码       |  8、see            察看在线用户          *\n\033[0m");
    printf("\033[;35m \t\t\t\t*           9、data  察看您的聊天记录| 10、send           发送文件              *\n\033[0m");
    printf("\033[;35m \t\t\t\t*         当前用户:%s                                                    *\n\033[0m",name);
    printf("\033[;35m \t\t\t\t*-------------------------------------------------------------------------------*\n\033[0m");
    printf("\033[;35m \t\t\t\t*          11、boot 踢某人出本聊天室 |  12、step 禁某人的言                     *\n\033[0m");
    printf("\033[;35m \t\t\t\t*          13、ban  解禁某人发言     |  14、set注销某人                         *\n\033[0m");
    printf("\033[;35m \t\t\t\t*                                                                               *\n\033[0m");
    printf("\033[;35m \t\t\t\t*         为了维护本智能聊天的数据安全和通信请勿登录超过20个客户端              *\n\033[0m");
    printf("\033[;35m \t\t\t\t*                                                                               *\n\033[0m");
    printf("\033[;35m \t\t\t\t*********************************************************************************\n\033[0m");

}
void insert_reg()
{
	system("reset");
    printf("\n");
	printf("\n");
	printf("\033[;31m \t\t\t\t\t________________________________________\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|                                      |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|       智能聊天室感谢您的注册         |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|                                      |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|     请输入用户名：                   |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|       请输入密码：                   |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|   请再次输入密码：                   |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|                                      |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|                                      |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|______________________________________|\n\033[0m");
	printf("\033[6A");
	printf("\033[60C");
}
void insert_log()
{
	system("reset");
    printf("\n");
	printf("\n");
	printf("\033[;31m \t\t\t\t\t________________________________________\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|                                      |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|       智能聊天室欢迎您的登录         |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|                                      |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|     请输入用户名：                   |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|       请输入密码：                   |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|                                      |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|                                      |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|______________________________________|\n\033[0m");
	printf("\033[5A");
	printf("\033[60C");
}
void insert_id()
{
	system("reset");
    printf("\n");
	printf("\n");
	printf("\033[;31m \t\t\t\t\t________________________________________\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|                                      |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|       智能聊天室欢迎您的登录         |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|                                      |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|         请输入ID：                   |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|       请输入密码：                   |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|                                      |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|                                      |\n\033[0m");
	printf("\033[;31m \t\t\t\t\t|______________________________________|\n\033[0m");
	printf("\033[5A");
	printf("\033[60C");
}
